#: CLI pretty things
brew "lsd"
brew "bat"
brew "diff-so-fancy"
# brew "tmux"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"

#: tiling window manager
brew "koekeishiya/formulae/yabai"
brew "jackielii/tap/skhd-zig"

#: programming language management
# brew "nvm"
brew "pyenv"

#: Applications
cask "visual-studio-code"
cask "cursor"
cask "google-chrome"
cask "spotify"
cask "discord"
cask "alacritty", args: { no_quarantine: true }
cask "claude-code"